Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/config.po
Languages: fr

source: Configuring Vidalia and Tor
fr: Configurer Vidalia et Tor

source: Vidalia allows you to configure some of the most commonly modified aspects of Vidalia and Tor. It also lets you set up and manage a <a href="server.html">Tor relay</a> so you can help the Tor network grow.
fr: Vidalia vous permet de configurer quelques-uns des aspects communément modifiables de Vidalia et de Tor. Il vous permet aussi de mettre en place et de gérer un <a href="server.html">relai Tor</a> afin d'aider le réseau Tor à grandir.

source: General Settings
fr: Paramètres généraux

source: Settings on the <i>General</i> page are the most commonly modified settings.
fr: Les paramètres sur la page <i>Paramètres généraux</i> sont les paramètres les plus souvent modifiés.

source: <b>Tor Executable</b>: This is the Tor executable that Vidalia will run when you select <i>Start</i> from the tray menu. If you have multiple versions of Tor installed, you can tell Vidalia which version you would like to run by clicking the <i>Browse</i> button and navigating to the particular Tor installation you want.
fr: <b>Exécutable Tor</b>: Ceci est le fichier exécutable de Tor que Vidalia lancera lorsque vous sélectionnerez <i>Démarrer</i> depuis le menu de la barre des tâches. Si vous avez plusieurs versions de Tor d'installées, vous pouvez indiquer à Vidalia quelle version vous aimeriez utiliser en cliquant le bouton <i>Parcourir</i> et en naviguant vers l'installation de Tor que vous préférez.

source: <b>Startup Options</b>: This setting allows you to have Vidalia automatically start Tor when Vidalia starts. You can also configure Vidalia to run when your system starts (<i>Windows only</i>).
fr: <b>Options de démarrage</b>: Ce paramètre vous permet de démarrer Tor automatiquement quand Vidalia démarre. Vous pouvez aussi configurer Vidalia pour démarrer en même temps que le système (<i>seulement Windows</i>).

source: Network Settings
fr: Paramètres du réseau

source: The <i>Network</i> settings page lets you change how Tor connects to the Tor network.
fr: La page des paramètres <i>Réseau</i> vous permet de modifier comment Tor se connecte au réseau Tor.

source: <b>I use a proxy to access the Internet</b>: If your Internet connection requires an HTTP proxy, you can configure Tor to send all of its directory requests and Tor relay connections through your proxy. You must specify at least the hostname or address of your proxy, and the port on which your proxy is listening for connections. If your proxy requires authentication, you can also enter the <i>Username</i> and <i>Password</i> you use to connect to your proxy. Otherwise, you can leave those fields blank.
fr: <b>J'utilise un proxy pour accéder à internet</b>: Si votre connexion Internet requiert un proxy HTTP, vous pouvez configurer Tor pour diriger toutes les requêtes et les connexions relais à travers ce proxy. Vous devez au moins spécifier le nom d'hôte ou l'adresse de votre proxy, et le port sur lequel le proxy attend des connexions. Si votre proxy demande une authetification, vous pouvez aussi entrer le <i>nom d'utilisateur</i> et le <i>mot de passe</i> que vous utilisez pour vous connecter à votre proxy. Autrement, vous pouvez laisser ces champs vides.

source: <b>My firewall only lets me connect to certain ports</b>: If you are behind a restrictive firewall or proxy that limits the ports you are able to connect to, you can configure Tor to connect directly only to relays listening on the ports allowed by your firewall or proxy. Simply enter a list of ports permitted by your firewall or proxy, separated by commas. (<i>Example: 80,443,8080</i>)
fr: <b>Mon pare-feu me permet de me connecter seulement sur certains ports</b>: si vous êtes derrière un pare-feu réstrictif ou derrière un proxy qui limite les connexions à certains ports seulement, vous pouvez configurer Tor de sorte à se connecter directement sur des relais qui écoutent seulement sur les ports autorisés par votre pare-feu ou proxy. Entrez simplement une liste de ports autorisés par votre pare-feu ou proxy, séparé par des virgules. (<i>Exemple: 80,443,8080</i>)

source: <b>My ISP blocks connections to the Tor network</b>: If your ISP (Internet Service Provider) blocks connections to the Tor network, Tor can attempt to avoid being filtered by encrypting its directory connections and connecting to the Tor network through relays called <i>bridges</i> (Tor 0.2.0.3-alpha or newer only). You can add bridge relays by specifying either their address and port number, or their address, port number, and fingerprint.
fr: <b>Mon FAI bloque des connexions sur le réseau Tor</b>: Si votre FAI (Fournisseur d'accès à Internet) bloque les connexions sur le réseau Tor, Tor peut tenter d'éviter ce filtrage en chiffrant ses connexions et en passant par des relais <i>passerelle</i> (à partir de la version Tor 0.2.0.3-alpha seulement). Vous pouvez ajouter des passerelles en spécifiant soit leur adresse et leur port soit leur adresse, leur numéro de port et leur empreinte.

source: Below are examples of valid bridge address formats:
fr: Voici quelques exemples de formats d'adresses de passerelles valides :

source: Even if you do not know any bridge relay addresses, checking this checkbox may still be helpful. Tor will encrypt its directory requests, which can defeat blocking mechanisms that try to filter Tor's requests for information about other relays. If connections to normal Tor relays are also blocked, then you will need to learn a bridge relay address somehow and add it here. See the help topic on <a href="bridges.html#finding">finding bridge relays</a> for more information on how to learn new bridge relay addresses and fingerprints.
fr: Même si vous ne connaissez pas d'adresse de passerelle, il peut être utile de cocher cette case. Tor chiffrera alors ses requêtes d'annuaire, ce qui peut contourner les mécanismes de blocage qui cherchent à filtrer les requêtes Tor qui concernent l'information sur d'autres relais. Si les connexions aux relais normaux sont également bloquées, il vous faudra trouver l'adresse d'une passerelle d'une manière ou d'une autre pour l'ajouter ici. Consultez cette d'aide sur la manière de <a href="bridges.html#finding">trouver une passerelle</a> en récupérant des adresses et des empreintes.

source: Relay Settings
fr: Paramètres relai

source: <i> See <a href="server.html">this help topic</a> for detailed information about setting up and managing a Tor relay. </i>
fr: <i> Lire <a href="server.html">l'aide</a> pour des informations détaillées sur la mise en place et la gestion d'un relai Tor. </i>

source: Appearance Settings
fr: Paramètres d'apparence

source: The settings on the <i>Appearance</i> page allow you to customize the look and feel of Vidalia.
fr: Les paramètres d'<i>apparence</i> vous permettent de personnaliser l'apparence de Vidalia.

source: <b>Language</b>: Vidalia's interface has been translated into many languages by helpful volunteers. When Vidalia is first run, it will try to guess which language your computer is currently using. If Vidalia guesses incorrectly, or if you prefer a different language, you can choose another language from the dropdown box. You will need to restart Vidalia after changing the displayed language for the changes to take effect.
fr: <b>Langue:</b>: l'interface de Vidalia a été traduite dans de nombreuses langues par des volontaires. Lorsque Vidalia est lancé pour la première fois, l'application tentera de deviner quelle est la langue employée sur l'ordinateur en cours d'utilisation. Si Vidalia n'a pas fait le bon choix ou bien si voous désirez utiliser une autre langue, vous pouvez en choisir une sur la liste déroulante. Vous devrez redémarrer Vidalia afin que la langue utilisée soit celle que vous avez choisie.

source: <b>Style</b>: In most cases, Vidalia will default to using your platform's default interface style. If you dislike the default, you can choose whichever interface style you prefer from the dropdown box.
fr: <b>Style</b>: Dans la plupart des cas, Vidalia utilisera le style par défaut de votre plateforme. Si ce dernier ne vous plaît pas, vous pouvez le changer en en sélectionnant un autre dans la liste déroulante.

source: Advanced Settings
fr: Paramètres avancés

source: The settings on the <i>Advanced</i> page should generally only be modified by more experienced users.
fr: Les paramètres de la page <i>Avancée</i> devraient être modifié, en règle générale, uniquement par des utilisateurs expérimentés.

source: <b>Control Address &amp; Port</b>: The <i>Control Port</i> is the port which Vidalia uses to talk to Tor. This doesn't need to be changed unless you have a conflict with another service on your machine, or if you are using Vidalia to control and monitor a Tor process running on another machine.
fr: <b>Adresse et Port de contrôle<b>: Le <i>Port de Contrôle</i> est le port utilisé par Vidalia pour communiquer avec Tor. Il n'y a pas besoin de le modifier à moins que vous ayez un conflit avec un autre service sur votre machine ou si vous utilisez Vidalia pour contrôler et surveiller un processus Tor qui tourne sur une autre machine.

source: <b>Control Port Authentication</b>: Control port authentication is used to limit the applications on your machine that can connect to and reconfigure your Tor installation. The available authentication methods are:
fr: <b>Authentification du Port de Contrôle</b>: L'authentification du port de contrôle est utilisée pour gérer quelles seront les applications de votre machine qui pourront se connecter et reconfigurer l'installation de Tor. Les méthodes d'authentification suivantes sont disponibles:

source: <b>None</b> -- No authentication is required. Use of this option is <b>strongly</b> discouraged. Any application or user on your computer can reconfigure your Tor installation.
fr: <b>Aucune</b> --Aucune authentification ne sera requise. Utiliser cette option est <b>fortement</b> déconseillée. Toute application ou utilisateur de cet ordinateur pourra alors reconfigurer votre installation de Tor.

source: <b>Password</b> <i>(Default)</i> -- If this method is selected, you can specify a password that Tor will require each time a user or application connects to Tor's control port. If Vidalia starts Tor for you, you can have Vidalia randomly generate a new password each time it starts Tor by checking the <i>Randomly Generate</i> checkbox.
fr: <b>Mot de passe</b> <i>(Défaut)</i> -- Lorsque cette méthode est employée, vous pouvez indiquer un mot de passe que Tor demandera chaque fois qu'un utilisateur ou une application tentera de se connecter au port de contrôle. Si Vidalia lance Tor pour vous, vous pouvez faire en sorte que l'application génère un nouveau mot de passe au hasard, à chaque fois qu'elle démarrera Tor en activant la case <i>Génération Aléatoire</i>.

source: <b>Cookie</b> -- If cookie authentication is selected, Tor will write a file (or, <i>cookie</i>) containing random bytes to its data directory when it starts. Any user or application that tries to connect to Tor's control port must be able to provide the contents of this cookie.
fr: <b>Cookie</b> -- Si l'authentification par cookie est employée, Tor écrira un fichier (ou, un <i>cookie</i>) contenant une suite aléatoire d'octets dans le répertoire de données, lors de son démarrage. Tout utilisateur ou application désirant se connecter au port de contrôle devra indiquer le contenu de ce cookie.

source: <b>Tor Configuration File</b> <i>(optional)</i>: You can use this option to have Vidalia start Tor using a specific <i>torrc</i>, Tor's configuration file. If you leave this field blank, Tor will uses its own default torrc location.
fr: <b>Fichier de configuration de Tor</b> <i>(optionnel)</i>: Vous pouvez utiliser cette option pour permettre à Vidalia de démarrer Tor en indiquant un fichier <i>torrc</i> spécifique. Si vous laissez ce champ à blanc, Tor utilisera l'emplacement par défaut.

source: <b>Tor Data Directory</b> <i>(optional)</i>: You can specify the directory in which Tor will store its saved data, such as cached Tor relay information, Tor relay keys, and configuration files. If you leave this field blank, Tor will use its own default data directory location.
fr: <b>Répertoire de Données de Tor</b> <i>(optionnel)</i>: Vous pouvez indiquer l'emplacement dans lequel Tor enregistrera ses données telles que le cache d'information sur les relais, les clefs ainsi que les fichiers de configuration. Si vous laissez ce champ à blanc, Tor utilisera l'emplacement par défaut.

source: <b>Permissions</b> <i>(optional, not available on Windows)</i>: If you enter a value for <b>Run as User</b>, Tor will <i>setuid</i> to this user when it starts. If you enter a value for <b>Run as Group</b>, Tor will <i>setgid</i> to this group when it starts.
fr: <b>Permissions</b> <i>(optionnel, non disponible sous Windows)</i>: Si vous indiquez une valeur pour le champ <b>Lancer sous l'utilisateur</b>, Tor effectuera un <i>setuid</i> vers cet utilisateur lorsqu'il démarrera. Si vous entrez une valeur pour <b>Lancer sous le groupe</b>, Tor effectuera un <i>setgid</i> vers ce groupe lorsqu'il démarrera.

source: Hidden Service Settings
fr: Paramètres des Services cachés

source: Hidden services allow you to provide any kind of TCP-based service, e.g. an HTTP service, to others without revealing your IP address.
fr: Les services cachés vous permettent de mettre à disposition d'autres personnes tout type de service basé sur le TCP, par exemple, un service HTTP, sans révéler votre adresse IP.
