Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/log.po
Languages: fr

source: Message Log
fr: Journal des messages

source: The message log lets you see status information about a running Tor process. <a name="basic"/> Each message has a <i>severity</i> associated with it, ranging from <b>Error</b> (most serious) to <b>Debug</b> (most verbose). See the help section on <a href="#severities">message severities</a> for more information. <a name="severities"/>
fr: Le Journal permet de suivre les informations d'état d'une instance de Tor en cours d'utilisation. <a name="basic"/> Chaque message est associé a un niveau de <i>gravité</i>, depuis <b>Erreur</b> (le plus sérieux) jusqu'à <b>Débogage</b> (le plus bavard). Consultez la section suivante sur la <a href="#severities">gravité des messages</a> pour davantage d'informations. <a name="severities"/>

source: Message Severities
fr: Niveaux de gravité des messages

source: A message's severity tells you how important the message is. A higher severity message usually indicates that something has gone wrong with Tor. Lower severity messages appear frequently during normal Tor operations and usually do not need to be logged.
fr: Le niveau de gravité permet de connaître l'importance d'un message. Un message de gravité supérieure indique généralement qu'un problème est survenu avec Tor. Les messages de gravité inférieure sont fréquents durant les opérations normales de Tor et il est habituellement inutile de les enregistrer.

source: The possible message severities, from most severe to least severe, are:
fr: Les niveaux de gravité sont les suivants, du plus au moins sévère:

source: <b>Error</b>: Messages that appear when something has gone very wrong and Tor cannot proceed. These messages will be highlighted in <i>red</i> in the message log.
fr: <b>Erreur</b>&nbsp;: Ces messages apparaissent lors des erreurs fatales, lorsque Tor ne peut pas poursuivre. Ces messages sont surlignés en <i>rouge</i> dans le Journal.

source: <b>Warning</b>: Messages that only appear when something has gone wrong with Tor, but are not fatal and Tor will continue running. These messages will be highlighted in <i>yellow</i>.
fr: <b>Avertissement</b>&nbsp;: Ces messages s'affichent lorsque Tor rencontre un problème qui ne l'empêche pas de continuer. Ils sont surlignés en <i>jaune</i>.

source: <b>Notice</b>: Messages that appear infrequently during normal Tor operation and are not considered errors, but you still may care about.
fr: <b>Signalement</b>&nbsp;: Ces messages apparaissent quelquefois lors des opérations normales de Tor. Ils ne sont pas considérés comme des erreurs, mais vous devez cependant y prêter attention.

source: <b>Info</b>: Messages that appear frequently during normal Tor operation and are not usually of interest to most users.
fr: <b>Information</b>&nbsp;: Ces messages renvoient aux opérations normales de Tor et ne présentent généralement pas d'intérêt pour la plupart des utilisateurs.

source: <b>Debug</b>: Extremely verbose messages that are primarily of interest to developers. You should generally not log debug messages unless you know what you are doing.
fr: <b>Débogage</b>&nbsp;: Ces messages extrêmement complets sont avant tout destinés aux développeurs. Vous ne devez généralement pas les afficher, sauf si vous savez exactement ce que vous faîtes.

source: Most users should only log <i>Error</i>, <i>Warning</i>, and <i>Notice</i> messages.
fr: La majorité des utilisateurs doivent afficher seulement les messages d'<i>erreur</i>, d'<i>avertissement</i> et de <i>signalement</i>.

source: To select which message severities you would like to see, do the following:
fr: Pour choisir les niveaux de gravité des messages que vous souhaitez afficher, vous devez suivre cette procédure&nbsp;:

source: Open the message log from the Vidalia tray menu.
fr: Ouvrez le Journal des messages à partir du menu Vidalia situé dans la zone de notification.

source: Click on <i>Settings</i> at the top of the message log window.
fr: Cliquez <i>Options</i> en haut de la fenêtre du Journal.

source: Check message severities you would like to see from the Message Filter group on the left and uncheck message severities you would like to hide.
fr: Cochez les niveaux de gravité que vous souhaitez afficher dans la fenêtre du Journal des messages et décochez les autres.

source: Click <i>Save Settings</i> to apply your new message filter.
fr: Cliquez <i>Enregistrer les options</i> pour utiliser votre nouveau filtre des messages.

source: Logging to a File
fr: Enregistrer les messages dans un fichier

source: Vidalia can also write log messages to a file, as well as logging them in the message log window. To enable logging to a file, follow these steps:
fr: Vidalia peut également enregistrer le Journal des messages dans un fichier en même temps qu'il les affiche dans la fenêtre du Journal. Pour permettre cet enregistrement, suivez ces étapes:

source: Check the box labeled <i>Automatically save new log messages to a file</i>.
fr: Cochez la case intitulé <i>Enregistrer automatiquement les nouveaux messages dans un fichier </i>.

source: If you would like to change the file to which messages will be written, either type the path and filename into the text box, or click <i>Browse</i> to navigate to a location for your log file.
fr: Si vous voulez changer le fichier dans lequel les messages sont enregistrés, entrez le chemin et le nom du fichier dans le champ ou cliquez <i>Parcourir</i> pour naviguer jusqu'à votre fichier d'historique.

source: Click <i>Save Settings</i> to save your log destination.
fr: Cliquez <i>Enregistrer les options</i> pour sauvegarder le chemin du Journal.
