Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/netview.po
Languages: de, fr

source: Network Viewer
de: Netzwerk-Betrachter
fr: Aperçu du réseau Tor

source: The network viewer lets you see relays in the Tor network and where your traffic is going.
de: Der Netzwerk-Betrachter zeigt die Server im Tor-Netzwerk und den Weg des Datenverkehrs an.
fr: L'aperçu du réseau Tor permet de connaître les relais du réseau Tor et de suivre ses propres données.

source: Overview
de: &Uuml;berblick
fr: Présentation

source: When you want to communicate anonymously through Tor (say, connecting to a website), Tor creates a tunnel, or <i>circuit</i>, of encrypted connections through a series of relays on the network. Your application's traffic is then sent as a <i>stream</i> through that circuit. For efficiency, multiple streams may share the same circuit.
de: Wenn Sie anonym mit Hilfe von Tor kommunizieren wollen (bspw. eine Verbindung zu einer Webseite herstellen), erstellt Tor einen Tunnel oder <i>Kanal</i> von verschl&uuml;sselten Verbindungen &uuml;ber verschiedene Server im Netzwerk. Der von ihrem Programm erzeugte Netzwerkverkehr wird dann als <i>Datenstrom</i> durch einen solchen Kanal geleitet. Aus Effizienzgr&uuml;nden werden mehrere Datenstr&ouml;me &uuml;ber den selben Kanal geleitet.
fr: Lorsque vous voulez communiquer anonymement à travers le réseau Tor, par exemple pour vous connecter à un site Web, Tor crée un tunnel (ou un <i>circuit</i>) de connexions chiffrées à travers une série de relais appartenant au réseau Tor. Le trafic de votre application est alors envoyé comme un <i>flux</i> au travers de ce circuit. Pour améliorer l'efficience du réseau Tor, de multiples flux peuvent partager le même circuit.

source: Network Map
de: Netzwerk-Karte
fr: Carte du réseau

source: The network map consists of a map of the world, with red pinpoints indicating the geographic location of relays in the Tor network. Green lines are drawn between relays to indicate the path of circuits that your Tor client has created through the Tor network.
de: Die Netzwerk-Karte besteht aus einer Weltkarte, auf der durch rote Punkte die geographischen Standorte der Server im Tor-Netzwerk gekennzeichnet sind. Anhand der gr&uuml;nen Linien zwischen den Servern werden die von Ihrem Tor-Client hergestellten Verbindungen im Tor-Netzwerk gekennzeichnet.
fr: La carte du réseau est une mappemonde sur laquelle des points rouges indiquent la localisation géographique des relais du réseau Tor. Les lignes vertes tracées entre certains relais correspondent aux circuits que votre client Tor a créé dans le réseau Tor.

source: You can zoom in on locations in the map by clicking the <b>Zoom In</b> and <b>Zoom Out</b> buttons in the toolbar. You can also scroll around on the map by clicking on the map and then dragging it in whatever direction you would like to move the map.
de: Durch einen Klick auf <b>Vergr&ouml;&szlig;ern</b> oder <b>Verkleinern</b> k&ouml;nnen Sie die Standorte auf der Karte betrachten. Um sich einen anderen Kartenausschnitt anzeigen zu lassen, klicken auf die Karte und bewegen Sie den Mauszeiger bei gedr&uuml;ckter Maustaste in die gew&uuml;nschte Richtung.
fr: Vous pouvez augmenter ou diminuer l'échelle de la carte en cliquant sur les boutons <b>Rapprocher</b> et <b>Éloigner</b> de la barre d'outils. Vous pouvez également faire défiler la carte en la cliquant et en bougeant la souris dans la direction que vous souhaitez.

source: The geographic location of a Tor relay is determined by looking up the IP address of the relay in a GeoIP database, created by MaxMind and located at geoip.vidalia-project.net.
de: Der geographische Standort eines Tor-Servers wird mit Hilfe der IP-Adresse und der GeoIP-Datenbank ermittelt. Die GeoIP-Datenbank wurde von Maxmind erstellt und ist unter geoip.vidalia-project.net zu finden.
fr: La localisation géographique d'un relais Tor est déterminée en envoyant son adresse IP dans la base de données GeoIP créée by MaxMind et localisée sur le serveur geoip.vidalia-project.net.

source: In the middle of the dialog, below the network map, you will see a list of your current circuits, as well as any application traffic currently on those circuits. When the network map first loads, you will probably see a connection to geoip.vidalia-project.net, which occurs when Vidalia is looking up geographic information for the list of Tor relays. It is important to note that this request is done through Tor, so your location is not revealed to the GeoIP relay. The results of the lookups will be cached locally in order to reduce load on Vidalia's GeoIP relays.
de: In der Mitte unterhalb der Netzwerk-Karte finden Sie eine Liste mit Ihren momentanen Verbindungen und den dar&uuml;br laufenden Netzwerkverkehr. Beim ersten Start der Netzwerk-Karte wird Ihnen m&ouml;glicherweise eine Verbindung zu geoip.vidalia-project.net auffallen. Diese Verbindung erscheint, wenn Vidalia den geographischen Standort f&uuml;r die Liste der Tor-Server ermittelt. Diese Verbindung wird ebenfalls &uuml;ber Tor hergestellt, so dass ihr Standort gegen&uuml;ber dem GeoIP-Server nicht bekannt gegeben wird. Die Ergebnisse dieser Anfragen werden lokal zwischen gespeichert, um Vidalias GeoIP-Server zu entlasten.
fr: La moitié inférieure de la fenêtre, sous la carte du réseau, présente la liste de vos circuits ainsi que le trafic de toutes les applications qui les utilisent. La première fois que la carte du réseau se charge, vous verrez probablement une connexion au serveur geoip.vidalia-project.net. Cette connexion signifie que Vidalia recherche les informations géographiques pour la liste des relais Tor. Il est important de noter que cette requête s'effectue par le biais de Tor et que votre localisation n'est donc pas révélée au relais GeoIP. Le résultat de cette recherche est mis en cache localement afin de réduire la charge des relais GeoIP de Vidalia.

source: <a name="relaylist"/>
fr: <a name="status"/>

source: Relay Status
de: Server-Status
fr: États des relais

source: On the left side of the network view, you will see a list of relays in the Tor network. Next to each relay is an icon indicating that relay's status. The following table summarizes the possible relay status icons:
de: Auf der linken Seite des Netzwerk-Betrachters befindet sich eine Liste von Servern im Tor-Netzwerk. Neben jeden Server befindet sich ein Symbol, dass den Server-Status anzeigt. Die folgende Tabelle beschreibt die "m&ouml;glichen Symbole:
fr: À gauche de la mappemonde est affichée la liste des relais du réseau Tor. L'état de chaque relais est indiqué par une icône. La table suivante donne le sens des différentes icônes.

source: The relay is offline or simply not responding.
de: Der Server ist offline oder antwortet einfach nicht.
fr: Le relais est hors ligne ou ne répond pas.

source: The relay is <i>hibernating</i>, meaning it is online, but has used up as much bandwidth as the operator is willing to allow for a given time period.
de: Der Server ist im <i>Ruhezustand</i>, d.h. er ist online, hat aber bereits alle ihm vom Serverbetreiber zugestandene Bandbreite w&auml;hrend eines bestimmten Zeitraums verbraucht.
fr: Le relais est en mode d'<i>hibernation</i>, c'est-à-dire qu'il est en ligne, mais qu'il a déjà utilisé toute la bande passante autorisée par l'opérateur pendant une certaine durée.

source: The relay is online, but has shown only minimal throughput.
de: Der Server ist online, hat aber nur einen minimalen Datendurchsatz.
fr: Le relais est en ligne, mais il supporte seulement un trafic minimal.

source: The relay is online and has shown a throughput &gt;= 20 KB/s.
de: Der Server ist online und hat einen ermittelten Datendurchsatz von &gt;= 20 KB/s.
fr: Le relais est en ligne et supporte un trafic &gt;= 20 Ko/s.

source: The relay is online and has shown a throughput &gt;= 60 KB/s.
de: Der Server ist online und hat einen ermittelten Datendurchsatz von &gt;= 60 KB/s.
fr: Le relais est en ligne et supporte un trafic &gt;= 60 Ko/s.

source: The relay is online and has shown a throughput &gt;= 400 KB/s.
de: Der Server ist online und hat einen ermittelten Datendurchsatz von &gt;= 400 KB/s.
fr: Le relais est en ligne et supporte un trafic &gt;= 400 Ko/s.

source: All bandwidth values are estimates based on the minimum of either the maximum bandwidth sustained input or output over any ten second period in the past day.
de: Alle Bandbreitenangaben sind Sch&auml;tzungen, die auf dem kleinsten Wert der maximalen Bandbreite des eingehenden oder ausgehenden Datenverkehrs basieren. Dieser Wert wurde innerhalb eines beliebigen zehn Sekunden langen Intervalls am vergangenen Tag gemessen.
fr: Les valeurs de trafic sont des estimations correspondant au minimum en entrée ou en sortie de la bande passante maximale soutenue durant toutes les périodes de dix secondes du jour précédent.

source: Relay Details
de: Server-Details
fr: Détails du relais

source: The relay details panel at the right side of the screen gives you details about the relay or relays currently selected in the <a href="#relaylist">relay list</a>. If you have selected a circuit or stream in the list of your current circuits and streams, this panel will show you details about each relay through which your traffic is currently being sent.
de: Die Server-Details auf der rechten Seite des Fensters zeigen weitere Informationen zu den Servern an, die momentan in der <a href=\"#serverlist\">Server-Liste</a> ausgew&auml;hlt wurden. Wenn Sie einen Kanal oder einen Datenstrom aus der entsprechenden Liste ausgew&auml;hlt haben, werden Ihnen in detailierte Informationen &uuml;ber jeden Server angezeigt, der Ihren Datenverkehr weiter leitet.
fr: Le panneau des détails du relais situé à la droite de l'écran montre les informations détaillées sur le ou les relais sélectionnés dans la <a href="#relaylist">liste des relais</a>. Si vous avez sélectionné un circuit ou un flux dans la liste de vos circuits et flux actuels, ce panneau donne des informations sur tous les relais où est envoyé votre trafic.

source: The fields that you may see in the panel are as follows (<i>Note</i>: not all of these fields will always be present):
de: Folgende Informationen werden in den Server-Details angezeigt (<i>Hinweis</i>: nicht immer sind alle Informationen verf&uuml;gbar):
fr: Les informations affichées dans ce panneau sont les suivantes (<i>Note</i>&nbsp;: certains champs ne sont pas forcément affichés)&nbsp;:

source: <b>Location</b>
de: <b>Ort</b>
fr: <b>Localisation</b>

source: The geographic location of this Tor relay.
de: Der geographische Standort dieses Tor-Servers.
fr: Localisation géographique de ce relais Tor.

source: <b>IP Address</b>
de: <b>IP-Adresse</b>
fr: <b>Adresse IP</b>

source: IP address at which this Tor relay can be reached.
de: IP-Adresse &uuml;ber die dieser Tor-Server erreicht werden kann.
fr: Adresse IP par laquelle ce relais Tor peut être atteint.

source: <b>Platform</b>
de: <b>Plattform</b>
fr: <b>Plateforme</b>

source: Operating system information and Tor version on which this relay is currently running.
de: Gibt an, mit welchen Betriebssystem und welcher Tor-Version dieser Server betrieben wird.
fr: Informations sur le système d'exploitation et sur la version de Tor utilisés par le relais.

source: <b>Bandwidth</b>
de: <b>Bandbreite</b>
fr: <b>Bande passante</b>

source: Estimated maximum amount of bandwidth that the directory relays have seen this relay handle recently.
de: Gesch&auml;tzte maximal Bandbreite, die der Verzeichnis-Server f&uuml;r diesen Server in letzter Zeit beobachtet hat.
fr: Niveau maximal de bande passante que le relais Tor a supporté récemment, estimé par les relais de l'annuaire.

source: <b>Uptime</b>
de: <b>L&auml;uft seit</b>
fr: <b>Durée de fonctionnement</b>

source: Length of time this relay has been available, which can be used to help estimate this relay's stability.
de: Gibt an, seit wann der Server bereits l&auml;ft. Dadurch kann die Stabilit&auml;t des Servers abgesch&auml;tzt werden.
fr: Durée pendant laquelle le relais a été disponible, ce qui est utile pour en évaluer la stabilité.

source: <b>Last Updated</b>
de: <b>Zuletzt aktualisiert</b>
fr: <b>Dernière mise à jour</b>

source: Date this relay's information was last updated.
de: Zeitpunkt an dem die Serverinformationen zuletzt aktualisiert wurden.
fr: Date à laquelle les informations sur ce relais ont été mises à jour.
