Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/running.po
Languages: de, fr

source: Running Tor
de: Tor betreiben
fr: Faire fonctionner Tor

source: Vidalia can help you control your Tor process by letting you start and stop Tor, as well as monitoring Tor's status and letting you know if it exits unexpectedly.
de: Vidalia hilft Ihnen dabei Ihren Tor-Prozess zu steuern. Es erm&ouml;glicht Ihnen Tor zu starten und zu beenden, zeigt Statusinformationen an und benachrichtigt Sie, falls Tor unerwartet beendet wurde.
fr: Vidalia peut vous aider à contrôler Tor en vous permettant de le lancer et de l'arrêter ainsi que de surveiller son état et de savoir si un incident s'est déroulé.

source: Starting and Stopping Tor
de: Tor starten und beenden
fr: Démarrer et arrêter Tor

source: To <i>start</i> Tor,
de: Um Tor zu <i>starten</i>,
fr: Pour <i>démarrer</i> Tor,

source: Select <i>Start</i> from Vidalia's tray menu or press <i>Ctrl+S</i>
de: w&auml;hlen Sie <i>Start</i> aus Vidalias Traymen&uuml; oder dr&uuml;cken Sie <i>Strg+S</i>
fr: Sélectionnez <i>Démarrer</i> depuis la barre de menu Vidalia ou appuyez sur <i>Ctrl+S</i>

source: Vidalia's tray icon will change from an onion with a red X to a green onion when Tor has started.
de: Vidalias Traysymbol wird sich von einer Zwiebel mit einem roten X hin zu einer gr&uuml;nen Zwiebel ver&auml;ndern, sobald Tor gestartet wurde.
fr: L'icône de barre de tâche Vidalia passera d'un oignon avec un X rouge à un oignon vert lorsque Tor aura démarré.

source: If Vidalia is unable to start Tor, Vidalia will display an error message telling you what went wrong. You can also look at your <a href="log.html">message log</a> to see if Tor printed any more information about what went wrong.
de: Falls Vidalia Tor nicht starten konnte, wird Ihnen eine Fehlermeldung mit entsprechenden Hinweisen angezeigt. Sie k&ouml;nnen au&szlig;erdem im <a href=\"log.html\">Nachrichtenprotokoll</a> nachschauen, ob Tor weitere Informationen ausgegeben hat.
fr: Si Vidalia ne peut pas démarrer Tor, l'application affichera un message d'erreur indiquant ce qui n'a pas fonctionné. Vous pouvez également consulter <a href="log.html">le journal des messages</a> pour voir si Tor a émis plus d'information sur ce qui ne s'est pas correctement déroulé.

source: To <i>stop</i> Tor,
de: Um Tor zu <i>stoppen</i>,
fr: Pour <i>arrêter</i> Tor,

source: Select <i>Stop</i> from Vidalia's tray menu or press <i>Ctrl+T</i>
de: w&auml;hlen Sie <i>Stop</i> aus Vidalias Traymen&uuml; oder dr&uuml;cken Sie <i>Strg+T</i>
fr: Sélectionnez <i>Arrêt</i> depuis le menu de barre des tâches Vidalia ou appuyez sur <i>Ctrl+T</i>

source: Vidalia's tray icon will change from a green onion to a gray onion with a red X when Tor has stopped.
de: Vidalias Traysymbol wird sich von einer gr&uuml;nen Zwiebel hin zu einer grauen Zwiebel mit einem roten X ver&auml;ndern, sobald Tor beendet wurde.
fr: L'icône de barre de tâche Vidalia passera d'un oignon vert à un oignon avec un X rouge lorsque Tor se sera arrêté.

source: If Vidalia was unable to stop Tor, Vidalia will display an error message telling you what went wrong. You can also look at your <a href="log.html">message log</a> to see if Tor printed any more information about what went wrong.
de: Falls Vidalia Tor nicht beenden konnte, wird Ihnen eine Fehlermeldung mit entsprechenden Hinweisen angezeigt. Sie k&ouml;nnen au&szlig;erdem im <a href=\"log.html\">Nachrichtenprotokoll</a> nachschauen, ob Tor weitere Informationen ausgegeben hat.
fr: Si Vidalia ne peut pas arrêter Tor, l'application affichera un message d'erreur indiquant ce qui n'a pas fonctionné. Vous pouvez également consulter <a href="log.html">le journal des messages</a> pour voir si Tor a émis plus d'information sur ce qui ne s'est pas correctement déroulé.

source: Monitoring Tor's Status
de: Tors Status &uuml;berwachen
fr: Surveiller l'état de Tor

source: Vidalia tells you about the status of Tor by displaying an icon in your system tray or dock area. The following table shows the different states indicated by an icon in your system's notification area:
de: Vidalia informiert Sie &uuml;ber den Status von Tor durch die Anzeige eines Symbols im Systemtray oder Dock. Die folgende Tabelle zeigt die verschiedenen Zust&auml;nde dieses Symbols:
fr: Vidalia vous renseigne sur l'état de Tor en affichant une icône dans votre barre des tâches. La table suivante indique les différents états indiqués par cette icône:

source: Tor is stopped. Select <i>Start</i> from the Vidalia menu to start Tor.
de: Tor wurde gestoppt. W&auml;hlen Sie <i>Start</i> aus dem Vidalia-Men&uuml; um Tor zu starten.
fr: Tor est arrêté. Sélectionnez <i>Démarrer</i> depuis le menu Vidalia pour démarrer Tor.

source: Tor is starting up. You can check the <a href="log.html">message log</a> for status information about Tor while it is starting.
de: Tor wird gestartet. Sie k&ouml;nnen im <a href=\"log.html\">Nachrichtenprotokoll</a> Statusinformationen abrufen, w&auml;hrend Tor startet.
fr: Tor est en cours de démarrage. Vous pouvez consultez <a href="log.html">le journal des évènements</a> pour obtenir une information sur l'état de Tor au cours de son démarrage.

source: Tor is running. If you want to stop Tor, select <i>Stop</i> from the Vidalia menu. Tor will print informational messages to the <a href="log.html">message log</a> while it is running, if you want to see what Tor is doing.
de: Tor wird ausgef&uuml;hrt. Falls Sie Tor stoppen wollen, w&auml;hlen Sie <i>Stop</i> aus dem Vidalia-Men&uuml;. Tor speichert w&auml;hrend des Betriebs Informationen im <a href=\"log.html\">Nachrichtenprotokoll</a>. Um weitere Informationen zu erfahren, k&ouml;nnen Sie dort nachschauen.
fr: Tor fonctionne. Si vous désirez l'arrêter, sélectionnez <i>Arrêt</i> depuis le menu Vidalia. Tor affichera ses messages d'informations dans <a href="log.html">le journal des évènements</a> si vous désirez voir ce qu'il fait.

source: Tor is in the process of shutting down.
de: Tor wird gerade gestoppt.
fr: Tor est en cours d'arrêt.

source: If Tor exits unexpectedly, Vidalia will change its icon to the dark onion with a red X and display an error message letting you know what went wrong. You can also check the <a href="log.html">message log</a> for details about any problems Tor encountered before it exited.
de: Falls Tor unerwartet beendet wird, ver&auml;ndert sich das Vidalia-Symbol zu einer dunklen Zwiebel mit einem roten X und eine entsprechende Fehlermeldung wird angezeigt. Sie k&ouml;nnen au&szlig;erdem das <a href=\"log.html\">Nachrichtenprotokoll</a> auf weitere Details zu Problemen untersuchen, die zur Beendigung von Tor gef&uuml;hrt haben.
fr: Si Tor se termine prématurément, Vidalia changera son icône en oignon noir avec une croix rouge et affichera un message d'erreur vous permettant de savoir ce qui n'a pas fonctionné. Vous pouvez également vérifier dans <a href="log.html">le journal des évènements</a> pour trouver plus de détails sur les problèmes que Tor a rencontré avant de se terminer.
