Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/services.po
Languages: fr

source: Hidden Services
fr: Les Services Cachés

source: Remark: Support for hidden services is new in Vidalia. You should expect it to have bugs, some of which possibly corrupting your hidden service configuration. So, don't rely on it, or rather, don't blame us if something goes wrong. If you find bugs or have comments on this new feature, please let us know! We need your feedback. <a name="about"/>
fr: Attention: Le support des services cachés est neuf sur Vidalia. Vous pouvez vous attendre à avoir des bogues et dans certains cas des corruption de votre configuration des services cachées. Donc, ne comptez pas sur cette fonctionnalité, ou plutôt, ne pas nous blâmez pas si quelque chose ne va pas. Si vous trouvez des bogues ou vous avez des commentaires sur cette nouvelle fonctionnalité, merci de nous le faire savoir! Nous avons besoin de vos commentaires. <a name="about"/>

source: What is a hidden service?
fr: Qu'est ce qu'un service caché ?

source: Hidden services allow you to provide any kind of TCP-based service, e.g. an HTTP service, to others without revealing your IP address. The protocol to provide a hidden service is built on top of the same circuits that Tor uses for anonymous browsing and roughly has similar anonymity properties.
fr: Les services cachés vous permettent de fournir n'importe quel type de service TCP, par exemple un service HTTP, à des tiers sans révéler votre adresse IP. Le protocole de fournir un service caché est construit pour utiliser les mêmes circuits que Tor utilise pour la navigation anonyme et a à peu près les mêmes caractéristiques d'anonymat.

source: For more information on hidden service you may want to read section 5 of Tor's design paper (doc/design-paper/tor-design.pdf) or the Rendezvous Specification (doc/spec/rend-spec.txt).
fr: Pour plus d'information sur les services cachés vous pouvez vouloir lirela partie 5 de la spécification technique de Tor (doc/design-paper/tor-design.pdf) ou la spécification de Rendez-Vous (doc/spec/rend-spec.txt).

source: How do I provide a hidden service?
fr: Comment proposer un service caché ?

source: Providing a hidden service consists of at least two steps:
fr: Fournir un service caché se fait en au moins deux étapes:

source: Install a web server locally (or a server for whatever service you want to provide, e.g. IRC) to listen for local requests.
fr: Installer un serveur web local (ou un serveur pour le quelconque service si vous souhaitez offrir, par ex IRC) pour écouter les requêtes locales.

source: Configure your hidden service, so that Tor relays requests coming from Tor users to your local server.
fr: Configurez votre service caché, de sorte que Tor relaie les requêtes entrantes des utilisateurs de Tor vers votre serveur local

source: There is a fine tutorial on the Tor website (https://www.torproject.org/docs/tor-hidden-service.html) that describes these steps in more detail.
fr: Il y a un bon tutoriel sur le site web de Tor (https://www.torproject.org/docs/tor-hidden-service.html) qui décrit ces étapes plus en détails.

source: What data do I need to provide?
fr: Quelles sont les données que je dois fournir ?

source: The services table contains five columns containing data about configured hidden services:
fr: La table des services comporte cinq colonnes contenant les données sur les services cachés configurés:

source: Onion Address (generated): The service (or onion) address is generated by Tor to uniquely identify your service. Give this onion address to the people who shall be able to access your service. You may use the "Copy to clipboard" button for that to avoid typos. If you have just created a hidden service, the field says "[Created by Tor]"; in order to make it display the real onion address, you need to save your configuration and re-open the settings window.
fr: Addresse Oignon(générée): L'adresse du service (ou adresse oignon) est créée par Tor pour identifier de manière unique votre service. Donnez cette adresse au personnes qui doivent accèder à votre service. Vous pouvez utiliser le bouton "Copier dans le presse-papiers" pour eviter les erreur de saisie.Si vous avez juste créé, le champ affiche "[Créé par Tor]"; afin de lui faire afficher l'adresse oignon réelle, vous devez sauver votre configuration et réouvrir la fenêtre des paramètres.

source: Virtual Port (required): This is the TCP port that clients will need to know in order to access your service. Typically, you will want to use the service-specific port here, e.g. port 80 for HTTP. Note that the virtual port usually has nothing to do with firewall settings, because it is only used Tor-internally.
fr: Port Virtuel(obligatoire): C'est le port TCP que les clients auront besoin à savoir pour avoir accès à votre service. En règle générale, vous voudrez utiliser le port de servicespécifique, par ex port 80 pour HTTP. Notez que le port virtuel a généralement rien à voir avec les paramètres de pare-feu, car il n'est utilisé que par Tor de manière locale.

source: Target (optional): Usually you want Tor to relay connection requests to localhost on a different port than the one you specified in "Virtual Port". Therefore, you can specify a target consisting of physical address and port to which requests to your hidden service are redirected, e.g. to localhost:5222 (or on whatever port your server is listening). If you don't specify any target, Tor will redirect requests to the port specified in "Virtual Port" on localhost.
fr: Destination (facultatif): Pratique si vous souhaitez que Tor relaie les demandes de connexion locale sur un port différent que celui que vous avez indiqué dans "Port virtuel". Par conséquent, vous pouvez spécifier une cible composée de adresse physique et le port où les demandes de votre service caché sont redirigés, par ex à localhost:5222 (ou sur n'importe quel port votre serveur est à l'écoute). Si vous ne spécifiez pas aucune cible, Tor va rediriger les demandes vers le port spécifié dans "port virtuel" de votre machine locale (localhost).

source: Service Directory (required): Tor needs to store some hidden-service specific files in a separate directory, e.g. a private key and a hostname file containing the onion address. This directory should be distinct from a directory containing content that the service provides. A good place for a service directory might be a sub directory in Tor's data directory. -- Note that you cannot change the directory of a running service (it wouldn't make much sense to allow it, because Vidalia is not supposed to move directories on your hard disk!). If you want to move a hidden service to another directory, please proceed as follows: Start by disabling the service in Vidalia and save the configuration. Then move the directory on your hard disk to the new place. Finally, change the directory in Vidalia to the new location, enable the service again, and save the new configuration.
fr: Répertoire du Service (obligatoire): Tor a besoin pour de stocker certains fichiers des services cachés dans un répertoire séparé, par ex la clé privée et le fichier nom d'hôte contenant l'adresse oignon. Ce répertoire devrait être doit être distinct du répertoire contenant le contenu du service fourni. Une bonne chose ce peut être un service de répertoire ce peut être un sous répertoire du répertoire Tor de données. -- Notez que vous ne pouvez pas changer le répertoire d'un service actif (cela n'aurait pas beaucoup de sens de permettre cela, car Vidalia n'est pas censé déplacer les répertoires sur votre disque dur !). Si vous souhaitez déplacer un service caché dans un autre répertoire, merci de procéder comme suit: Commencez par désactiver le service dans Vidalia et sauver la configuration. Puis déplacez le répertoire de votre disque dur au nouveau endroit. Enfin, changez le répertoire dans Vidalia vers le nouvel emplacement, activez à nouveau le service, et enregistrez la nouvelle configuration.

source: Enabled: If this checkbox is disabled, Vidalia will not configure the given hidden service in Tor. This can be useful for keeping the configuration of a currently unused service for later use. All non-enabled services are stored in the Vidalia-specific configuration file vidalia.conf.
fr: Activé: Si cette case à cocher est désactivée, Vidalia ne configurera pas le service caché correspondant dans Tor. Cela peut être utile pour garder une configuration d'un service non utilisée actuellement pour une utilisation ultérieure. Tous services inactives sont stockées dans le fichier de configuration spécifique de Vidalia vidalia.conf.

source: What are the five buttons used for?
fr: A quoi servent les cinq boutons ?

source: Add service: Creates a new empty service configuration.
fr: Ajouter un service: Crée une nouvelle configuration de services.

source: Remove service: Permanently removes a hidden service configuration. (If you want to temporarily remove a service, uncheck its Enabled checkbox.)
fr: Supprimer un service: Supprime de façon permanente une configuration de service caché. (Si vous voulez temporairement retirer un service, décochez sa case Activé.)

source: Copy to clipboard: Copies the onion address to the clipboard, so that you can tell it to whoever shall be able to use your service.
fr: Copie dans le presse-papier: Copie l'adresse oignon dans le presse-papiers, de sorte que vous puissiez l'annoncer à tous ceux qui doivent être en mesure d'utiliser votre service.

source: Browse: Lets you browse to find a local hidden service directory.
fr: Parcourir: Vous permet de naviguer pour trouver un répertoure de service caché.

source: How can I configure advanced hidden service settings?
fr: Comment configurer les paramètres avancés des services cachés ?

source: Tor allows configuration of more specific settings for hidden services, e.g. forcing to use (or avoiding) certain nodes as introduction points, or providing multiple virtual ports for the same service.
fr: Tor permet la configuration des paramètres plus spécifiques pour les services cachés, par ex forçer à utiliser (ou éviter), certains noeuds comme des points d'introduction, ou Fournir de multiples ports virtuels pour le même service.

source: However, we decided to simplify things in Vidalia and provide only the most common settings. If you want to configure advanced settings, you need to do so in Tor's torrc file. Vidalia will not remove those settings even when you are editing your hidden services. If you specify more than one virtual port, only the first will be displayed and be editable.
fr: Toutefois, nous avons décidé de simplifier les choses dans Vidalia et de fournir seulement les paramètres les plus communs. Si vous voulez configurer les paramètres avancés, vous devez le faire Tor dans le fichier torrc. Vidalia ne supprimera pas ces paramètres, même lorsque vous modifiez vos services cachés. Si vous spécifier plus d'un port virtuel port, seule le premièr sera affiché et sera modifiable.

source: How does Vidalia help me to access other hidden services?
fr: Est ce que Vidalia m'aide à accéder aux autres services cachés ?

source: Not at all. There is no need to do so. If you want to access another hidden service, type the service's onion address in your browser (or appropriate client application if it's not a web service), and Tor does the rest for you. There is no need to specifically configure Tor for that.
fr: Pas du tout. Il n'est pas nécessaire de faire quelque chose. Si vous voulez accéder à un autre service caché , tapez l'adresse onion du service dans votre navigateur (ou dans le client approprié si ce n'est pas un service web), et Tor fait le reste pour vous. Il n'est pas nécessaire de configurer Tor spécifiquement pour cela.
