Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/server.po
Languages: fr

source: Setting Up a Tor Relay
fr: Installer un relais Tor

source: The Tor network is made up of volunteers all over the world who donate some of their spare bandwidth by running a Tor relay. Vidalia helps you do your part by making it easy to set up a relay of your own. <a name="basic"/>
fr: Le réseau Tor est constitué par des bénévoles du monde entier qui donnent une partie de leur bande passante perdue en installant un relais Tor. Vidalia vous aide à participer au réseau Tor en facilitant l'installation de votre propre relais. <a name="basic"/>

source: Basic Settings
fr: Options de base

source: If you decide you want to help the Tor network grow by running a relay, you can follow these steps to get started:
fr: Si vous décidez de participer à la croissance du réseau Tor en installant un relais, vous pouvez suivre la procédure suivante.

source: Open the <i>Configuration Dialog</i> by selecting <i>Settings</i> from the tray menu or <i>Preferences</i> from your system menubar on Macintosh systems.
fr: Ouvrez la <i>fenêtre de configuration</i> en sélectionnant <i>Options</i> dans le menu de la zone de notification ou <i>Préférences</i> dans la barre de menu système pour les systèmes Macintosh.

source: Select the <i>Relay</i> configuration page.
fr: Sélectionnez la page de configuration <i>Relais</i>.

source: Decide whether you want to run a normal Tor relay or a <i>bridge</i> relay (Tor 0.2.0.8-alpha or newer). Bridge relays help censored Tor users who are blocked from accessing the Tor network directly. Check the box labeled <i>Relay traffic for the Tor network</i> if you want to run a normal Tor relay or <i>Help censored users reach the Tor network</i> if you want to run a bridge relay.
fr: Précisez si vous souhaitez installer un relais Tor normal ou un relais <i>passerelle</i> (Tor 0.2.0.8-alpha ou plus récent). Une passerelle permet d'aider les utilisateurs de Tor bloqués par la censure et qui ne peuvent pas accéder directement au réseau Tor. Cochez la case <i>Relayer le trafic pour le réseau Tor</i> si vous voulez installer un relais Tor normal ou <i>Aider les utilisateurs censurés à accéder au réseau Tor</i> si vous voulez installer un relais passerelle.

source: Enter the following information:
fr: Indiquez les informations suivantes:

source: <b>Nickname</b>: The name which your relay will be known as on the Tor network. An example of a relay nickname is "MyVidaliaRelay".
fr: <b>Surnom (nickname)</b>: Le nom qui permettra à votre relais d'être connu sur le réseau Tor. Il s'agit par exemple de "MonRelaisVidalia".

source: <b>Contact Info</b>: Your e-mail address. This address will only be used to contact you in case there is an important Tor security update or something goes wrong with your relay. You might also include your PGP or GPG key ID and fingerprint.
fr: <b>Information de contact</b>: Votre adresse électronique. Cette adresse sera utilisée seulement pour vous signaler une mise à jour de sécurité importante ou un problème avec votre relais. Vous pouvez également préciser votre identifiant PGP ou GPG et votre empreinte.

source: <b>Relay Port</b>: The port on which your relay will listen for traffic from clients or other Tor relays.
fr: <b>Port du relais</b>: Le port par lequel votre relais écoutera le trafic de clients ou d'autres relais Tor.

source: If you would like to mirror Tor's directory of relays for others on the network you can check the box labeled <i>Mirror the Relay Directory</i>. If you do not have much bandwidth, uncheck this box. If you do decide to mirror the relay directory, make sure the <i>Directory Port</i> is different than the <i>Relay port</i> you entered above. Bridge relays <i>must</i> mirror the relay directory.
fr: Si vous voulez également installer un miroir de l'annuaire Tor des relais, cochez la case <i>Servir de miroir à l'annuaire des relais</i>. Si vous disposez d'une bande passante limitée, décochez cette case. Si vous décidez malgré tout d'installer un miroir de l'annuaire, assurez-vous que le <i>port de l'annuaire</i> est différent du <i>port du relais</i> que vous avez indiquez plus haut. Les passerelles <i>doivent</i> avoir un miroir de l'annuaire des relais.

source: Bandwidth Limits
fr: Limites de la bande passante

source: Running a Tor relay can consume a large amount of bandwidth; however, Tor allows you to limit the amount of bandwidth that you are willing to contribute to the Tor network. You can run a relay, while still keeping your network connection usable for your own use.
fr: Un relais Tor peut consommer une grande quantité de bande passante. C'est la raison pour laquelle Tor vous permet de préciser le niveau de bande passante que vous souhaitez accorder au réseau Tor. Cela vous permet de faire fonctionner un relais Tor tout en conservant une connexion suffisante pour votre propre usage.

source: You should select the option in the dropdown box that best matches your connection speed. If you select <i>Custom</i>, you will be able to specify your own limits.
fr: Vous devez sélectionner dans la liste déroulante l'option qui correspond le mieux au débit de votre connexion. Si vous choisissez <i>Personnalisé</i>, vous pourrez paramétrer vous-mêmes les seuils.

source: Custom Limits
fr: Limites personnalisées

source: The <i>maximum rate</i> is a pool of bytes used to fulfill requests during short periods of traffic higher than your specified <i>average rate</i>, but still maintains the average over a long period. A low average rate but a high maximum rate enforces a long-term average while still allowing more traffic during peak times if the average hasn't been reached lately. If your average rate is the same as your <i>maximum rate</i>, then Tor will never exceed the specified rate. Your <i>maximum rate</i> must always be greater than or equal to your <i>average rate</i>.
fr: Le <i>débit maximal</i> correspond au nombre d'octets utilisables pour répondre aux requêtes pendant les courtes périodes où le trafic est supérieur au <i>débit moyen</i> que vous avez spécifié, mais qui permet de respecter la moyenne sur une longue période. Un débit moyen bas et un débit maximal élevé améliorent le niveau de trafic à long terme en autorisant davantage de trafic lors des pics, tant que le débit moyen n'a pas été atteint. Si votre débit moyen est identique à votre <i>débit maximal</i>, alors Tor ne dépassera jamais ce débit. Le <i>débit maximal</i> doit toujours être supérieur ou égal au <i>débit moyen</i>.

source: The <i>average rate</i> is the maximum long-term average bandwidth allowed (in kilobytes per second). For example, you might want to choose 2 megabytes per second (2048 KB/s), or 50 kilobytes per second (a medium-speed cable connection). Tor requires a minimum of 20 kilobytes per second to run a relay.
fr: Le <i>débit moyen</i> correspond à la bande passante moyenne maximale autorisée à long terme (en kilo-octets par seconde). Par exemple, vous pouvez choisir de contribuer au réseau Tor pour 2 méga-octets par seconde (2048 Kio/s) ou 50 kilo-octets par seconde (soit une connexion moyenne par cable). Tor a besoin au minimum de 20 kilo-octets par seconde pour faire fonctionner un relais.

source: It is important to remember that Tor measures bandwidth in <b>bytes</b>, not bits. Also, Tor only looks at incoming bytes instead of outgoing bytes. For example, if your relay acts as a directory mirror, you may be sending more outgoing bytes than incoming. If you find this is the case and is putting too much strain on your bandwidth, you should consider unchecking the checkbox labeled <i>Mirror the relay directory</i>.
fr: Il est important de se rappeler que Tor mesure la bande passante en <b>octets</b> et non en bits. En outre, Tor comptabilise les octets entrants et non les octets sortants. De ce fait, si votre relais est également un miroir de l'annuaire des relais, vous enverrez davantage de données que vous n'en recevrez. Si vous constatez que cela constitue une contrainte trop forte pour votre bande passante, vous devrez penser à décocher la case <i>Servir de miroir à l'annuaire des relais</i>.

source: Exit Policies
fr: Politiques de sortie

source: Exit policies give you a way to specify what kinds of resources on the Internet you are willing let other Tor users access from your Tor relay. Tor uses a default list of exit policies that restrict some services, such as mail to prevent spam and some default file sharing ports to reduce abuse of the Tor network.
fr: Les politiques de sortie vous permettent de spécifier les ressources Internet auxquelles les utilisateurs du réseau Tor peuvent accéder par le biais de votre relais. Par défaut, Tor utilise une liste de politiques de sortie qui empêche l'utisation de certains services, notamment l'envoi de courriels (afin d'éviter les spams) et certains ports de partage de fichiers (afin de réduire l'usage abusif du réseau Tor).

source: Each of the checkboxes represents a type of resource that you can allow Tor users to access through your relay. If you uncheck the box next to a particular type of resource, Tor users will not be allowed to access that resource from your relay. If the box labeled <i>Misc Other Services</i> is checked, Tor users will be able to access other services not covered by the other checkboxes or Tor's default exit policy.
fr: Chaque case représente un type de ressources. Vous pouvez permettre ou refuser aux utilisateurs de Tor de passer par votre relais pour y accéder. Si vous décocher une case, les utilisateurs de Tor ne seront pas autorisés à accéder à la ressource correspondante à travers votre relais. Si la case <i>Autres services</i> est cochée, les utilisateurs de Tor pourront accéder aux services non couverts par les autres cases à cocher ou par la politique de sortie par défaut de Tor.

source: For completeness, the following table lists the specific port numbers represented by each of the exit policy checkboxes. The <b>Description</b> column describes the resources Tor clients will be allowed to access through your relay, if the associated box is checked.
fr: Pour information, le tableau suivant liste les numéros de ports des politiques de sortie. La colonne <b>Description</b> signale les ressources auxquelles les clients Tor pourront accéder à travers votre relais, si la case correspondante est coché.

source: <b>Checkbox</b>
fr: <b>Case à cocher</b>

source: Websites
fr: Sites web

source: Normal, unencrypted Web browsing
fr: Normal, navigation web non chiffrée

source: Secure Websites (SSL)
fr: Sites web sécurisés (SSL)

source: Encrypted Web browsing
fr: Accès aux sites web sécurisés

source: Retrieve Mail (POP, IMAP)
fr: Téléchargement des courriels (POP, IMAP)

source: Downloading email (does not permit sending email)
fr: Téléchargement des courriels (ne permet pas d'en envoyer)

source: Instant Messaging (IM)
fr: Messagerie instantanée (IM)

source: Instant messaging applications like MSN Messenger, AIM, ICQ, and Jabber
fr: Applications de messageries instantanées telles que Jabber, MSN Messenger, AIM et ICQ

source: Internet Relay Chat (IRC)
fr: Chat (IRC)

source: IRC clients and servers
fr: Clients et serveurs IRC

source: Misc. Other Services
fr: Autres services

source: All other applications that aren't covered by the previous checkboxes
fr: Toutes les autres applications non couvertes par les précédentes cases à cocher

source: If you do not want to let other Tor users make connections outside the Tor network from your relay, you can uncheck all of the checkboxes. Even if you uncheck all of the checkboxes, your relay is still useful to the Tor network. Your relay will allow other Tor users to connect to the Tor network and will help relay traffic between other Tor relays.
fr: Si vous ne voulez pas autoriser les utilisateurs de Tor à sortir du réseau par votre relais, vous pouvez décocher toutes les cases. Même dans ce cas, votre relais est utile pour le réseau Tor, car il permet encore aux utilisateurs de s'y connecter. Il permet également de relayer du trafic entre les autres relais Tor.

source: If you chose to run a bridge relay, the <i>Exit Policies</i> tab will be grayed out, since bridge relays do not allow exit connections. Bridges are only used by Tor clients to connect to the Tor network.
fr: Si vous choisissez d'installer un relais passerelle, l'onglet des <i>Politiques de sortie</i> sera grisé et inacessible, puisque une passerelle n'autorise pas les sorties&nbsp;: elle sert uniquement à se connecter au réseau Tor.

source: Port Forwarding
fr: Transfert de Ports

source: Many home users connect to the Internet via a <i>router</i>, which allows multiple computers on a local network to share the same Internet connection. Some users may also be behind a <i>firewall</i> that blocks incoming connections to your computer from other computers on the Internet. If you want to run a Tor relay, however, other Tor clients and relays must be able to connect to your relay through your home router or firewall.
fr: De nombreux utilisateurs se connectent à Internet par un <i>routeur</i>, qui permet plusieurs ordinateurs sur un réseau local de partager la même connexion Internet. Certains utilisateurs peuvent également être derrière un <i>pare-feu</i> qui bloque les connexions à votre ordinateur à partir d'autres ordinateurs d'Internet. Si vous voulez, toutefois, opérer un relais Tor, d'autres clients et relais Tor doivent être en mesure de se connecter à votre relais à travers votre routeur ou votre pare-feu.

source: To make your relay publicly accessible, your router or firewall needs to know which ports to allow through to your computer by setting up what is known as <i>port forwarding</i>. Port forwarding configures your router or firewall to "forward" all connections to certain ports on your router or firewall to local ports on your computer.
fr: Pour rendre votre relais publiquement accessible, votre routeur ou pare-feu doit savoir quels ports autoriser pour votre ordinateur, la mise en place est connu sous le nom de <i> transfert de ports </i>. Le transfert de ports configure votre routeur ou pare-feu pour "rediriger" toutes les connexions de certains ports de votre routeur ou pare-feu locaux vers les ports ouverts correspondants de votre ordinateur.

source: If you check the box labeled <i>Attempt to automatically configure port forwarding</i>, Vidalia will attempt to automatically set up port forwarding on your local network connection so that other Tor clients can connect to your relay. Not all routers support automatic port forwarding, though. You can use the <i>Test</i> button next to the checkbox to find out if Vidalia is able to automatically set up port forwarding for you.
fr: Si vous cochez la case <i>Tenter de configurer automatiquement le transfert de ports</i>, Vidalia tentera de mettre en place automatiquement le transfert de port sur votre connexion réseau pour que les autres Tor clients puissent se connecter à votre relais. Mais, tous les routeurs ne supportent pas le transfert automatique de ports. Vous pouvez utiliser le bouton<i>Test</i> à côté de la case à cocher pour savoir si Vidalia est en mesure de mettre en place automatiquement le transfert de port pour vous.

source: If the <i>Test</i> button finds that Vidalia is unable to set up port forwarding for you, you may need to enable this feature on your router or set up port forwarding manually. Some network devices have a feature called <i>Universal Plug-and-Play</i> (UPnP). If you can access your router's administrative interface, you should look for an option to enable UPnP. The administrative interface for most routers can be accessed by opening <a href="http://192.168.0.1/">http://192.168.0.1</a> or <a href="http://192.168.1.1/">http://192.168.1.1</a> in your Web browser. You should consult your router's instruction manual for more information.
fr: Si le <i>Test</i> estime que Vidalia n'est pas en mesure de mettre en place le transfert de port pour vous, vous pouvez activer cette fonctionalité sur votre routeur ou paramétrer la redirection de port manuellement. Certains périphériques réseau ont une fonction appelée <i>Universal Plug-and-Play</i> (UPnP). Si vous pouvez accéder à votre routeur interface d'administration, vous devriez chercher à activer une option UPnP. Le interface d'administration de la plupart des routeurs peut être accessible en ouvrant <a href="http://192.168.0.1/">http://192.168.0.1</a> ou <a href="http://192.168.1.1/">http://192.168.1.1</a> dans votre navigateur. Vous devriez consulter le manuel d'instruction de votre routeur pour de plus amples informations.

source: If you need to set up port forwarding manually, the website <a href="http://www.portforward.com/english/routers/port_forwarding/routerindex.htm"> portforward.com</a> has instructions for how to set up port forwarding for many types of routers and firewalls. At a minimum, you will need to forward your <i>Relay Port</i>, which defaults to port 443 on Windows and 9001 on all other operating systems. If you also checked the checkbox labeled <i>Mirror the relay directory</i>, then you will also need to forward your <i>Directory Port</i>. The <i>Directory Port</i> is set to port 9030 by default on all operating systems.
fr: Si vous devez configurer manuellement le transfert de port, le site <a href = "http://www.portforward.com/english/routers/port_forwarding/routerindex.htm"> portforward.com </a> contient des instructions sur la manière de mettre en place la redirection de port pour de nombreux types de routeurs et pare-feu. Au minimum, vous aurez besoin de transférer <i>votre Port Relais</i>, qui par défaut est le port 443 sur Windows et 9001 sur tous les autres systèmes d'exploitation. Si vous avez aussi coché la case <i>Servir de miroir à l'annuaire des relais</i>, vous devrez également trasferrer votre <i> Port Annuaire</i>. Le <i> Port Annuaire</i> est le port 9030 par défaut sur tous les les systèmes d'exploitation.
