Repository: BrentonEarl/vidalia
Catalog: src/vidalia/help/content/po/*/troubleshooting.po
Languages: fr

source: Troubleshooting
fr: Dépannage

source: Listed below are some of the common problems or questions people have while running Tor. If you can't find anything about the particular problem you're having, check out our website at <i>www.vidalia-project.net</i> for more support and information. <a name="start"/>
fr: Voici une liste de quelques problèmes et de questions rencontrées lors de l'utilisation de Tor. Si vous ne trouvez rien sur votre problème en particulier, consultez notre site web sur <i>www.vidalia-project.net</i> pour plus d'information et pour un support plus complet. <a name="start"/>

source: I Can't Start Tor
fr: Je ne peux pas démarrer Tor

source: The most likely reason that Vidalia could not start Tor is because Vidalia is looking for your Tor installation in the wrong directory. You can tell Vidalia where Tor is located by updating the <i>Tor Executable</i> option in the <a href="config.html#general">general configuration settings</a>.
fr: La raison principale pour laquelle Vidalia ne peut pas lancer Tor est lié au fait que Vidalia n'arrive pas à localiser correctement où est installé Tor. Vous pouvez indiquer cet emplacement à Vidalia en mettant à jour l'option <i>Exécutable Tor</i> dans les <a name="start"/>paramètres de configuration générale</a>.

source: Another possible reason that Tor cannot start is because there is already another Tor process running. Check your list of running process and stop the previous Tor process, if you find one. Then, try running Tor again.
fr: Une autre raison de non-démarrage de Tor est le fait qu'il existe déjà un processus Tor qui fonctionne. Vérifiez votre liste de processus en cours et arrêter l'ancien processus Tor si vous le trouvez. Ensuite, relancez Tor.

source: If that did not help, check your <a href="log.html">message log</a> to see if Tor printed any information about errors it encountered while trying to start.
fr: Si ça ne fonctionne toujours pas, vérifiez votre <a href="log.html">journal d'évènements</a> pour voir si Tor a inscrit des informations sur les erreurs qu'il a rencontré lors de sa tentative de lancement.

source: Vidalia Can't Connect to Tor
fr: Vidalia ne peut pas se connecter à Tor

source: Vidalia manages Tor by communicating with it via Tor's <i>control port</i>.
fr: Vidalia gère Tor en communiquant avec lui via <i>le port de contrôle</i>.

source: The most common reason that Vidalia cannot connect to Tor is because Tor started, but encountered an error and exited immediately. You should check your <a href="log.html">message log</a> to see if Tor reported any errors while it started.
fr: La raison principale du fait que Vidalia ne peut se connecter à Tor est liée à un arrêt prématuré de ce dernier. Vous devriez consulter votre <a href="log.html">journal des évènements</a> pour voir si Tor a remonté des erreurs lors de son lancement.

source: If Tor is listening on a different port than Vidalia expects, Vidalia will be unable to connect to Tor. You rarely need to change this setting, but if there is another service running on your machine that conflicts with Tor's control port, you will need to specify a different port. You can change this setting in Vidalia's <a href="config.html#advanced">advanced configuration settings</a>.
fr: Si Tor écoute sur un port différent de celui qui est configuré dans Vidalia, ce dernier ne pourra pas se connecter à Tor. Vous aurez rarement besoin de modifier ce paramètre. Néanmoins, si un service de votre machine utilise déjà le port de contrôle de port, vous aurez besoin d'indiquer un autre port. Vous pouvez modifier ce paramètre dans les <a href="config.html#advanced">paramètres avancés de configuration</a>.

source: Why is Vidalia asking me for a "control password"?
fr: Pourquoi Vidalia me demande un "mot de passe de contrôle" ?

source: Vidalia interacts with the Tor software via Tor's "control port". The control port lets Vidalia receive status updates from Tor, request a new identity, configure Tor's settings, etc. Each time Vidalia starts Tor, Vidalia sets a random password for Tor's control port to prevent other applications from also connecting to the control port and potentially compromising your anonymity.
fr: Vidalia interagit avec Tor via "le port de contrôle". Ce port permet à Vidalia de recevoir des informations sur l'état de Tor, de demander une nouvelle identité, de configurer les paramètres de Tor, etc... Chaque fois que Vidalia lance Tor, l'application génère un mot de passe aléatoire pour le port de contrôle de manière à empêcher d'autres applications de s'y connecter et de compromettre votre anonymat.

source: Usually this process of generating and setting a random control password happens in the background. There are three common situations, though, where Vidalia may prompt you for a password:
fr: En règle générale, le processus de génération de mot de passe aléatoire a lieu en tâche de fond. Il existe trois situations au cours desquelles, Vidalia peut vous demander de saisir un mot de passe:

source: You're already running Vidalia and Tor. For example, this situation can happen if you installed the Vidalia bundle and now you're trying to run the Tor Browser Bundle. In that case, you'll need to close the old Vidalia and Tor before you can run this one.
fr: Vous avez déjà lancé Vidalia et Tor. Par exemple, cette situation survient lorsque vous avez installé le Pack Vidalia et que vous lancez le Pack de navigation Tor. Dans ce cas, vous aurez besoin de fermer l'ancienne instance de Vidalia et de Tor avant de lancer la nouvelle.

source: Vidalia crashed, but left Tor running with the last known random password. After you restart Vidalia, it generates a new random password, but Vidalia can't talk to Tor, because the random passwords are different.
fr: Vidalia a échoué mais Tor continue à fonctionner avec l'ancien mot de passe aléatoire. Une fois que vous aurez redémarrez Vidalia, un nouveau mot de passe sera généré mais Vidalia ne pourra dialoguer avec Tor car les deux mots de passe seront différents.

source: If the dialog that prompts you for a control password has a <i>Reset</i> button, you can click the button and Vidalia will restart Tor with a new random control password.
fr: Si la boîte de dialogue qui vous propose de saisir un mot de passe de contrôle dispose d'un bouton <i>Mise à jour</i>, vous pouvez cliquer dessus et Vidalia redémarrera Tor avec un nouveau mot de passe.

source: If you do not see a <i>Reset</i> button, or if Vidalia is unable to restart Tor for you, you can still fix the problem manually. Simply go into your process or task manager, and terminate the Tor process. Then use Vidalia to restart Tor and all will work again.
fr: Si aucun bouton <i>Mise à jour</i> n'est présent ou bien si Vidalia ne peut pas redémarrer Tor pour vous, vous pouvez toutefois corriger le problème manuellement. Allez simplement dans votre gestionnaire de processus ou de tâches et fermez le processus Tor. Utilisez ensuite Vidalia pour redémarrer Tor et tout fonctionnera à nouveau.

source: You had previously set Tor to run as a service. When Tor is set to run as a service, it starts up when the system boots. If you configured Tor to start as a service through Vidalia, a random password was set and saved in Tor. When you reboot, Tor starts up and uses the random password it saved. You login and start up Vidalia. Vidalia attempts to talk to the already running Tor. Vidalia generates a random password, but it is different than the saved password in the Tor service.
fr: Vous avez précédemment configuré Tor pour fonctionner en tant que service. Lorsque Tor est un service, il se lance lors du démarrage de la machine. Si vous avez configuré Tor pour démarrer en tant que service par Vidalia, un mot de passe aléatoire a été généré et sauvegardé dans Tor. Lorsque vous redémarrez votre machine, Tor se lance et utilise cet ancien mot de passe. Vous ouvrez une session et démarrez Vidalia qui tente de dialoguer avec le processus Tor actif. Vidalia génère un mot de passe aléatoire mais qui sera différent de celui sauvegardé et utilisé par le service Tor.

source: You need to reconfigure Tor to not be a service. See the Tor wiki page on running <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#WinNTService"> Tor as a service</a> for more information on how to remove the Tor service.
fr: Vous aurez besoin de reconfigurer Tor pour qu'il ne fonctionne pas en tant que service. Consultez la page du wiki sur la gestion de <a href="https://wiki.torproject.org/noreply/TheOnionRouter/TorFAQ#WinNTService">Tor en tant que service</a> pour plus d'information ou pour découvrir comment supprimer le service Tor.

source: Tor Exited Unexpectedly
fr: Tor s'est terminé prématurément

source: If Tor exits immediately after trying to start, you most likely have another Tor process already running. Check the <a href="log.html">message log</a> to see if any of the last few messages in the list are highlighted in yellow and contain a message similar to the following:
fr: Si Tor échoue immédiatement après avoir été lancé, vous avez de grandes chances qu'un processus Tor soit déjà en fonctionnement. Vérifiez <a href="log.html">le journal des évènements</a> pour voir si un des derniers messages de la liste est surligné en jaune et contient un message proche de ce qui suit:

source: If you find an error message like the one above, you will need to stop the other Tor process before starting a new one with Vidalia. On Windows, you would need to look for <i>tor.exe</i> in your Task Manager. On most other operating systems, the <i>ps</i> command can help you find the other Tor process.
fr: Si vous trouvez un message d'erreur comme celui du dessus, vous aurez besoin d'arrêter le processus Tor avant d'en lancer un nouveau à l'aide de Vidalia. Sur Windows, vous aurez besoin de chercher après <i>tor.exe</i> dans votre gestionnaire des tâches. Sur la plupart des autres systèmes d'exploitation, la commande <i>ps</i> peut vous aider à trouver l'autre processus Tor.

source: If Tor had been running successfully for awhile (that is, longer than a few seconds), then you should check the <a href="log.html">message log</a> for information about any errors Tor experienced before it exited. Such errors will be highlighted in either red or yellow.
fr: Si Tor a fonctionné correctement depuis quelquetemps (plus que quelques secondes), alors vous devriez vérifier <a href="log.html">le journal des évènements</a> pour d'autres informations sur les erreurs que Tor a rencontré avant de se terminer. De telles erreurs sont surlignées soit en rouge, soit en jaune.

source: Vidalia Can't Stop Tor
fr: Vidalia ne peut pas arrêter Tor

source: If Vidalia cannot stop Tor, you should check your <a href="log.html">message log</a> to see if Tor reported any errors while trying to exit.
fr: Si Vidalia ne peut pas arrêter Tor, vous devriez vérifier <a href="log.html">le journal des évènements</a> pour voir si Tor a rapporté d'autres erreurs lors de sa tentative de fermeture.
